AmbiqAI/neuralSPOT/extern/AmbiqSuite/R3.1.1/mcu/apollo3p/regs/am_mcu_apollo3p_info0.h
// SIGNATURE3 - Word 3 (high word, bits 127:96) of the 128-bit INFO0 signature. The value in SIGNATURE* determines if the rest of INFO0 is valid. The reset value is the uninitialized signature for SIGNATURE3. The valid signature is 0xE41A9D74.
#define AM_REG_INFO0_SIGNATURE3_SIG3_S 0
#define AM_REG_INFO0_SIGNATURE3_SIG3_M 0xFFFFFFFF
#define AM_REG_INFO0_SIGNATURE3_SIG3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SECURITY - This 32-bit word contains the customer programmable security.
#define AM_REG_INFO0_SECURITY_SECPOL_S 24
#define AM_REG_INFO0_SECURITY_SECPOL_M 0x07000000
#define AM_REG_INFO0_SECURITY_SECPOL(n) (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_INFO0_SECURITY_KEYWRAP_S 20
#define AM_REG_INFO0_SECURITY_KEYWRAP_M 0x00F00000
#define AM_REG_INFO0_SECURITY_KEYWRAP(n) (((uint32_t)(n) << 20) & 0x00F00000)
#define AM_REG_INFO0_SECURITY_RSVD19_S 19
#define AM_REG_INFO0_SECURITY_RSVD19_M 0x00080000
#define AM_REG_INFO0_SECURITY_RSVD19(n) (((uint32_t)(n) << 19) & 0x00080000)
#define AM_REG_INFO0_SECURITY_SECBOOTONRST_S 16
#define AM_REG_INFO0_SECURITY_SECBOOTONRST_M 0x00070000
#define AM_REG_INFO0_SECURITY_SECBOOTONRST(n) (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_INFO0_SECURITY_RSVD15_S 15
#define AM_REG_INFO0_SECURITY_RSVD15_M 0x00008000
#define AM_REG_INFO0_SECURITY_RSVD15(n) (((uint32_t)(n) << 15) & 0x00008000)
#define AM_REG_INFO0_SECURITY_SECBOOT_S 12
#define AM_REG_INFO0_SECURITY_SECBOOT_M 0x00007000
#define AM_REG_INFO0_SECURITY_SECBOOT(n) (((uint32_t)(n) << 12) & 0x00007000)
#define AM_REG_INFO0_SECURITY_PLONEXIT_S 11
#define AM_REG_INFO0_SECURITY_PLONEXIT_M 0x00000800
#define AM_REG_INFO0_SECURITY_PLONEXIT(n) (((uint32_t)(n) << 11) & 0x00000800)
#define AM_REG_INFO0_SECURITY_SDBG_S 10
#define AM_REG_INFO0_SECURITY_SDBG_M 0x00000400
#define AM_REG_INFO0_SECURITY_SDBG(n) (((uint32_t)(n) << 10) & 0x00000400)
#define AM_REG_INFO0_SECURITY_BOOTLOADER_AT_RESET_S 9
#define AM_REG_INFO0_SECURITY_BOOTLOADER_AT_RESET_M 0x00000200
#define AM_REG_INFO0_SECURITY_BOOTLOADER_AT_RESET(n) (((uint32_t)(n) << 9) & 0x00000200)
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_ERASE_S 8
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_ERASE_M 0x00000100
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_ERASE(n) (((uint32_t)(n) << 8) & 0x00000100)
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_PROG_S 4
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_PROG_M 0x000000F0
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_PROG(n) (((uint32_t)(n) << 4) & 0x000000F0)
#define AM_REG_INFO0_SECURITY_SECURE_LOCK_S 3
#define AM_REG_INFO0_SECURITY_SECURE_LOCK_M 0x00000008
#define AM_REG_INFO0_SECURITY_SECURE_LOCK(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_INFO0_SECURITY_RSVD02_S 2
#define AM_REG_INFO0_SECURITY_RSVD02_M 0x00000004
#define AM_REG_INFO0_SECURITY_RSVD02(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_INFO0_SECURITY_RSVD01_S 1
#define AM_REG_INFO0_SECURITY_RSVD01_M 0x00000002
#define AM_REG_INFO0_SECURITY_RSVD01(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_SECURITY_DEBUG_PROT_S 0
#define AM_REG_INFO0_SECURITY_DEBUG_PROT_M 0x00000001
#define AM_REG_INFO0_SECURITY_DEBUG_PROT(n) (((uint32_t)(n) << 0) & 0x00000001)

// CUSTOMER_TRIM - Customer Programmable trim overrides.  Bits in this register are loaded into hardware registers at reset.
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEM_CTRL_S 3
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEM_CTRL_M 0x00000008
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEM_CTRL(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEATURE_ENABLE_S 2
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEATURE_ENABLE_M 0x00000004
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEATURE_ENABLE(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_BUCK_ENABLE_S 1
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_BUCK_ENABLE_M 0x00000002
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_BUCK_ENABLE(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_CUSTOMER_TRIM_SIMO_BUCK_ENABLE_S 0
#define AM_REG_INFO0_CUSTOMER_TRIM_SIMO_BUCK_ENABLE_M 0x00000001
#define AM_REG_INFO0_CUSTOMER_TRIM_SIMO_BUCK_ENABLE(n) (((uint32_t)(n) << 0) & 0x00000001)

// CUSTOMER_TRIM2 - Customer Programmable trim overrides.  Bits in this register are used by software for hardware configuration.
#define AM_REG_INFO0_CUSTOMER_TRIM2_XO32M_FREQ_TRIM_S 0
#define AM_REG_INFO0_CUSTOMER_TRIM2_XO32M_FREQ_TRIM_M 0x000007FF
#define AM_REG_INFO0_CUSTOMER_TRIM2_XO32M_FREQ_TRIM(n) (((uint32_t)(n) << 0) & 0x000007FF)

// SECURITY_OVR - This 32-bit word contains the override configuration for forcing GPIO-based firmware update.
#define AM_REG_INFO0_SECURITY_OVR_POL_S 7
#define AM_REG_INFO0_SECURITY_OVR_POL_M 0x00000080
#define AM_REG_INFO0_SECURITY_OVR_POL(n) (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_INFO0_SECURITY_OVR_GPIO_S 0
#define AM_REG_INFO0_SECURITY_OVR_GPIO_M 0x0000007F
#define AM_REG_INFO0_SECURITY_OVR_GPIO(n) (((uint32_t)(n) << 0) & 0x0000007F)

// SECURITY_WIRED_CFG - This 32-bit word contains the configuration for the wired update interface.
#define AM_REG_INFO0_SECURITY_WIRED_CFG_TIMEOUT_S 16
#define AM_REG_INFO0_SECURITY_WIRED_CFG_TIMEOUT_M 0xFFFF0000
#define AM_REG_INFO0_SECURITY_WIRED_CFG_TIMEOUT(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_INFO0_SECURITY_WIRED_CFG_I2CADDR_S 9
#define AM_REG_INFO0_SECURITY_WIRED_CFG_I2CADDR_M 0x0000FE00
#define AM_REG_INFO0_SECURITY_WIRED_CFG_I2CADDR(n) (((uint32_t)(n) << 9) & 0x0000FE00)
#define AM_REG_INFO0_SECURITY_WIRED_CFG_SLVINTPIN_S 3
#define AM_REG_INFO0_SECURITY_WIRED_CFG_SLVINTPIN_M 0x000001F8
#define AM_REG_INFO0_SECURITY_WIRED_CFG_SLVINTPIN(n) (((uint32_t)(n) << 3) & 0x000001F8)
#define AM_REG_INFO0_SECURITY_WIRED_CFG_IFC_S 0
#define AM_REG_INFO0_SECURITY_WIRED_CFG_IFC_M 0x00000007
#define AM_REG_INFO0_SECURITY_WIRED_CFG_IFC(n) (((uint32_t)(n) << 0) & 0x00000007)

// SECURITY_WIRED_IFC_CFG0 - This 32-bit word contains the interface configuration word0 for the UART wired update.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_M 0x0FFFFF00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE(n) (((uint32_t)(n) << 8) & 0x0FFFFF00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_S 6
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_M 0x000000C0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN(n) (((uint32_t)(n) << 6) & 0x000000C0)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_S 5
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_M 0x00000020
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP(n) (((uint32_t)(n) << 5) & 0x00000020)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_S 4
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_M 0x00000010
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN(n) (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_S 3
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_M 0x00000008
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_PAR(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_S 2
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_M 0x00000004
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_CTS(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_S 1
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_M 0x00000002
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_RTS(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_UART_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_UART_M 0x00000001
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_UART(n) (((uint32_t)(n) << 0) & 0x00000001)

// SECURITY_WIRED_IFC_CFG1 - This 32-bit word contains the interface configuration word1 for the UART wired update.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_M 0x0000FF00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_WIRED_IFC_CFG2 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 0.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

