AmbiqAI/neuralSPOT/extern/AmbiqSuite/R3.1.1/mcu/apollo3p/regs/am_mcu_apollo3p_info0.h
// SECURITY_WIRED_IFC_CFG3 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 1.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_WIRED_IFC_CFG4 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 2.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_WIRED_IFC_CFG5 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 3.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_VERSION - This 32-bit word contains the version ID used for revision control
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_S 0
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_M 0xFFFFFFFF
#define AM_REG_INFO0_SECURITY_VERSION_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SECURITY_SRAM_RESV - This 20-bit word indicates the amount of SRAM to keep reserved for application scratch space. This reserves the specified memory at the top end of SRAM memory address range. This memory is not disturbed by the Secure Boot Loader
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_S 0
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_M 0x000FFFFF
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV(n) (((uint32_t)(n) << 0) & 0x000FFFFF)

// WRITE_PROTECT_0 - These bits write-protect flash in 16KB chunks.
#define AM_REG_INFO0_WRITE_PROTECT_0_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_1 - These bits write-protect flash in 16KB chunks.
#define AM_REG_INFO0_WRITE_PROTECT_1_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_2 - These bits write-protect flash in 16KB chunks.
#define AM_REG_INFO0_WRITE_PROTECT_2_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_3 - These bits write-protect flash in 16KB chunks.
#define AM_REG_INFO0_WRITE_PROTECT_3_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_0 - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_0_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_1 - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_1_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_2 - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_2_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_3 - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_3_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

