AmbiqAI/neuralSPOT/extern/AmbiqSuite/R3.1.1/mcu/apollo3p/regs/am_mcu_apollo3p_info0.h
// WRITE_PROTECT_SBL_0 - These bits write-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_WRITE_PROTECT_SBL_0_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_SBL_0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_SBL_0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_SBL_1 - These bits write-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_WRITE_PROTECT_SBL_1_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_SBL_1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_SBL_1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_SBL_2 - These bits write-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_WRITE_PROTECT_SBL_2_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_SBL_2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_SBL_2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_SBL_3 - These bits write-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_WRITE_PROTECT_SBL_3_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_SBL_3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_SBL_3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_SBL_0 - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_SBL_0_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_SBL_0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_SBL_0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_SBL_1 - These bits read-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_COPY_PROTECT_SBL_1_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_SBL_1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_SBL_1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_SBL_2 - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_SBL_2_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_SBL_2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_SBL_2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_SBL_3 - These bits read-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_COPY_PROTECT_SBL_3_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_SBL_3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_SBL_3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_PTR0 - This is the main/sbl_main firmware pointer 0 referenced by sbl_init for pointing to the main or sbl_main base address
#define AM_REG_INFO0_MAIN_PTR0_PTR0_S 0
#define AM_REG_INFO0_MAIN_PTR0_PTR0_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_PTR0_PTR0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_PTR1 - This is the main/sbl_main firmware pointer 1 referenced by sbl_init for pointing to the main or sbl_main base address
#define AM_REG_INFO0_MAIN_PTR1_PTR1_S 0
#define AM_REG_INFO0_MAIN_PTR1_PTR1_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_PTR1_PTR1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// KREVTRACK - KEK Key Revocation Tracker. Monotonic counter where bits represents validity of a key index (each key index represents a 128b key in the keybank). Bit 31 represents first OEM key index (8) and bit 24 represents last OEM key index (15). Bits 0-23 are reserved. Example: To revoke KEK8, the INFO0:KREVTRACK would need to be updated to 0x7FFFFFFF.
#define AM_REG_INFO0_KREVTRACK_KTRCKER_S 24
#define AM_REG_INFO0_KREVTRACK_KTRCKER_M 0xFF000000
#define AM_REG_INFO0_KREVTRACK_KTRCKER(n) (((uint32_t)(n) << 24) & 0xFF000000)

// AREVTRACK - AUTH Key Revocation Tracker. Monotonic counter where bits represents validity of a key index (each key index represents a 128b key in the keybank). Bit 31 represents first OEM key index (8) and bit 24 represents last OEM key index (15). Bits 0-23 are reserved. Example: To revoke AUTH8, the INFO0:AREVTRACK would need to be updated to 0x7FFFFFFF.
#define AM_REG_INFO0_AREVTRACK_ATRCKER_S 24
#define AM_REG_INFO0_AREVTRACK_ATRCKER_M 0xFF000000
#define AM_REG_INFO0_AREVTRACK_ATRCKER(n) (((uint32_t)(n) << 24) & 0xFF000000)

// MAIN_CNT0 - Index counter for main or sbl_main firmware. Counter is used to indicate which pointer to reference, MAINPTR1 or MAINPTR2
#define AM_REG_INFO0_MAIN_CNT0_INDXCNTR_S 0
#define AM_REG_INFO0_MAIN_CNT0_INDXCNTR_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_CNT0_INDXCNTR(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_CNT1 - Index counter for main or sbl_main firmware. Counter is used to indicate which pointer to reference, MAINPTR1 or MAINPTR2
#define AM_REG_INFO0_MAIN_CNT1_INDXCNTR_S 0
#define AM_REG_INFO0_MAIN_CNT1_INDXCNTR_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_CNT1_INDXCNTR(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W0 - This is the Customer KEK Word0. Keys are represented using key Index. Valid values for OEM key indices are 8-15. Each key index comprises of 128 bits (4 words) in the keybank, with words CUST_KEK_W0-3 representing key index 8, and so on.
#define AM_REG_INFO0_CUST_KEK_W0_CUSTKEK_W0_S 0
#define AM_REG_INFO0_CUST_KEK_W0_CUSTKEK_W0_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W0_CUSTKEK_W0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W1 - This is the Customer KEK Word1.
#define AM_REG_INFO0_CUST_KEK_W1_CUSTKEK_W1_S 0
#define AM_REG_INFO0_CUST_KEK_W1_CUSTKEK_W1_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W1_CUSTKEK_W1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W2 - This is the Customer KEK Word2.
#define AM_REG_INFO0_CUST_KEK_W2_CUSTKEK_W2_S 0
#define AM_REG_INFO0_CUST_KEK_W2_CUSTKEK_W2_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W2_CUSTKEK_W2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W3 - This is the Customer KEK Word3.
#define AM_REG_INFO0_CUST_KEK_W3_CUSTKEK_W3_S 0
#define AM_REG_INFO0_CUST_KEK_W3_CUSTKEK_W3_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W3_CUSTKEK_W3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W4 - This is the Customer KEK Word4.
#define AM_REG_INFO0_CUST_KEK_W4_CUSTKEK_W4_S 0
#define AM_REG_INFO0_CUST_KEK_W4_CUSTKEK_W4_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W4_CUSTKEK_W4(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W5 - This is the Customer KEK Word5.
#define AM_REG_INFO0_CUST_KEK_W5_CUSTKEK_W5_S 0
#define AM_REG_INFO0_CUST_KEK_W5_CUSTKEK_W5_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W5_CUSTKEK_W5(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W6 - This is the Customer KEK Word6.
#define AM_REG_INFO0_CUST_KEK_W6_CUSTKEK_W6_S 0
#define AM_REG_INFO0_CUST_KEK_W6_CUSTKEK_W6_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W6_CUSTKEK_W6(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W7 - This is the Customer KEK Word7.
#define AM_REG_INFO0_CUST_KEK_W7_CUSTKEK_W7_S 0
#define AM_REG_INFO0_CUST_KEK_W7_CUSTKEK_W7_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W7_CUSTKEK_W7(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W8 - This is the Customer KEK Word8.
#define AM_REG_INFO0_CUST_KEK_W8_CUSTKEK_W8_S 0
#define AM_REG_INFO0_CUST_KEK_W8_CUSTKEK_W8_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W8_CUSTKEK_W8(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W9 - This is the Customer KEK Word9.
#define AM_REG_INFO0_CUST_KEK_W9_CUSTKEK_W9_S 0
#define AM_REG_INFO0_CUST_KEK_W9_CUSTKEK_W9_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W9_CUSTKEK_W9(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

