AmbiqAI/neuralSPOT/extern/AmbiqSuite/R3.1.1/mcu/apollo3p/regs/am_mcu_apollo3p_info0.h
// CUST_KEK_W10 - This is the Customer KEK Word10.
#define AM_REG_INFO0_CUST_KEK_W10_CUSTKEK_W10_S 0
#define AM_REG_INFO0_CUST_KEK_W10_CUSTKEK_W10_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W10_CUSTKEK_W10(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W11 - This is the Customer KEK Word11.
#define AM_REG_INFO0_CUST_KEK_W11_CUSTKEK_W11_S 0
#define AM_REG_INFO0_CUST_KEK_W11_CUSTKEK_W11_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W11_CUSTKEK_W11(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W12 - This is the Customer KEK Word12.
#define AM_REG_INFO0_CUST_KEK_W12_CUSTKEK_W12_S 0
#define AM_REG_INFO0_CUST_KEK_W12_CUSTKEK_W12_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W12_CUSTKEK_W12(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W13 - This is the Customer KEK Word13.
#define AM_REG_INFO0_CUST_KEK_W13_CUSTKEK_W13_S 0
#define AM_REG_INFO0_CUST_KEK_W13_CUSTKEK_W13_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W13_CUSTKEK_W13(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W14 - This is the Customer KEK Word14.
#define AM_REG_INFO0_CUST_KEK_W14_CUSTKEK_W14_S 0
#define AM_REG_INFO0_CUST_KEK_W14_CUSTKEK_W14_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W14_CUSTKEK_W14(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W15 - This is the Customer KEK Word15.
#define AM_REG_INFO0_CUST_KEK_W15_CUSTKEK_W15_S 0
#define AM_REG_INFO0_CUST_KEK_W15_CUSTKEK_W15_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W15_CUSTKEK_W15(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W16 - This is the Customer KEK Word16.
#define AM_REG_INFO0_CUST_KEK_W16_CUSTKEK_W16_S 0
#define AM_REG_INFO0_CUST_KEK_W16_CUSTKEK_W16_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W16_CUSTKEK_W16(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W17 - This is the Customer KEK Word17.
#define AM_REG_INFO0_CUST_KEK_W17_CUSTKEK_W17_S 0
#define AM_REG_INFO0_CUST_KEK_W17_CUSTKEK_W17_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W17_CUSTKEK_W17(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W18 - This is the Customer KEK Word18.
#define AM_REG_INFO0_CUST_KEK_W18_CUSTKEK_W18_S 0
#define AM_REG_INFO0_CUST_KEK_W18_CUSTKEK_W18_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W18_CUSTKEK_W18(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W19 - This is the Customer KEK Word19.
#define AM_REG_INFO0_CUST_KEK_W19_CUSTKEK_W19_S 0
#define AM_REG_INFO0_CUST_KEK_W19_CUSTKEK_W19_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W19_CUSTKEK_W19(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W20 - This is the Customer KEK Word20.
#define AM_REG_INFO0_CUST_KEK_W20_CUSTKEK_W20_S 0
#define AM_REG_INFO0_CUST_KEK_W20_CUSTKEK_W20_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W20_CUSTKEK_W20(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W21 - This is the Customer KEK Word21.
#define AM_REG_INFO0_CUST_KEK_W21_CUSTKEK_W21_S 0
#define AM_REG_INFO0_CUST_KEK_W21_CUSTKEK_W21_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W21_CUSTKEK_W21(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W22 - This is the Customer KEK Word22.
#define AM_REG_INFO0_CUST_KEK_W22_CUSTKEK_W22_S 0
#define AM_REG_INFO0_CUST_KEK_W22_CUSTKEK_W22_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W22_CUSTKEK_W22(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W23 - This is the Customer KEK Word23.
#define AM_REG_INFO0_CUST_KEK_W23_CUSTKEK_W23_S 0
#define AM_REG_INFO0_CUST_KEK_W23_CUSTKEK_W23_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W23_CUSTKEK_W23(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W24 - This is the Customer KEK Word24.
#define AM_REG_INFO0_CUST_KEK_W24_CUSTKEK_W24_S 0
#define AM_REG_INFO0_CUST_KEK_W24_CUSTKEK_W24_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W24_CUSTKEK_W24(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W25 - This is the Customer KEK Word25.
#define AM_REG_INFO0_CUST_KEK_W25_CUSTKEK_W25_S 0
#define AM_REG_INFO0_CUST_KEK_W25_CUSTKEK_W25_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W25_CUSTKEK_W25(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W26 - This is the Customer KEK Word26.
#define AM_REG_INFO0_CUST_KEK_W26_CUSTKEK_W26_S 0
#define AM_REG_INFO0_CUST_KEK_W26_CUSTKEK_W26_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W26_CUSTKEK_W26(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W27 - This is the Customer KEK Word27.
#define AM_REG_INFO0_CUST_KEK_W27_CUSTKEK_W27_S 0
#define AM_REG_INFO0_CUST_KEK_W27_CUSTKEK_W27_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W27_CUSTKEK_W27(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W28 - This is the Customer KEK Word28.
#define AM_REG_INFO0_CUST_KEK_W28_CUSTKEK_W28_S 0
#define AM_REG_INFO0_CUST_KEK_W28_CUSTKEK_W28_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W28_CUSTKEK_W28(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W29 - This is the Customer KEK Word29.
#define AM_REG_INFO0_CUST_KEK_W29_CUSTKEK_W29_S 0
#define AM_REG_INFO0_CUST_KEK_W29_CUSTKEK_W29_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W29_CUSTKEK_W29(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W30 - This is the Customer KEK Word30.
#define AM_REG_INFO0_CUST_KEK_W30_CUSTKEK_W30_S 0
#define AM_REG_INFO0_CUST_KEK_W30_CUSTKEK_W30_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W30_CUSTKEK_W30(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W31 - This is the Customer KEK Word31.
#define AM_REG_INFO0_CUST_KEK_W31_CUSTKEK_W31_S 0
#define AM_REG_INFO0_CUST_KEK_W31_CUSTKEK_W31_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W31_CUSTKEK_W31(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W0 - This is the Customer AUTH Key Word0. Keys are represented using key Index. Valid values for OEM key indices are 8-15. Each key index comprises of 128 bits (4 words) in the keybank, with words CUST_AUTH_W0-3 representing key index 8, and so on.
#define AM_REG_INFO0_CUST_AUTH_W0_CUSTAUTH_W0_S 0
#define AM_REG_INFO0_CUST_AUTH_W0_CUSTAUTH_W0_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W0_CUSTAUTH_W0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W1 - This is the Customer AUTH Key Word1.
#define AM_REG_INFO0_CUST_AUTH_W1_CUSTAUTH_W1_S 0
#define AM_REG_INFO0_CUST_AUTH_W1_CUSTAUTH_W1_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W1_CUSTAUTH_W1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W2 - This is the Customer AUTH Key Word2.
#define AM_REG_INFO0_CUST_AUTH_W2_CUSTAUTH_W2_S 0
#define AM_REG_INFO0_CUST_AUTH_W2_CUSTAUTH_W2_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W2_CUSTAUTH_W2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W3 - This is the Customer AUTH Key Word3.
#define AM_REG_INFO0_CUST_AUTH_W3_CUSTAUTH_W3_S 0
#define AM_REG_INFO0_CUST_AUTH_W3_CUSTAUTH_W3_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W3_CUSTAUTH_W3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W4 - This is the Customer AUTH Key Word4.
#define AM_REG_INFO0_CUST_AUTH_W4_CUSTAUTH_W4_S 0
#define AM_REG_INFO0_CUST_AUTH_W4_CUSTAUTH_W4_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W4_CUSTAUTH_W4(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W5 - This is the Customer AUTH Key Word5.
#define AM_REG_INFO0_CUST_AUTH_W5_CUSTAUTH_W5_S 0
#define AM_REG_INFO0_CUST_AUTH_W5_CUSTAUTH_W5_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W5_CUSTAUTH_W5(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

