AmbiqAI/neuralSPOT/extern/AmbiqSuite/R3.1.1/mcu/apollo3p/regs/am_mcu_apollo3p_info0.h
// CUST_PUBKEY_W0 - This is the Customer Public Key Word0.
#define AM_REG_INFO0_CUST_PUBKEY_W0_CUSTPUBKEY_W0_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W0_CUSTPUBKEY_W0_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W0_CUSTPUBKEY_W0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W1 - This is the Customer Public Key Word1.
#define AM_REG_INFO0_CUST_PUBKEY_W1_CUSTPUBKEY_W1_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W1_CUSTPUBKEY_W1_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W1_CUSTPUBKEY_W1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W2 - This is the Customer Public Key Word2.
#define AM_REG_INFO0_CUST_PUBKEY_W2_CUSTPUBKEY_W2_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W2_CUSTPUBKEY_W2_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W2_CUSTPUBKEY_W2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W3 - This is the Customer Public Key Word3.
#define AM_REG_INFO0_CUST_PUBKEY_W3_CUSTPUBKEY_W3_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W3_CUSTPUBKEY_W3_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W3_CUSTPUBKEY_W3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W4 - This is the Customer Public Key Word4.
#define AM_REG_INFO0_CUST_PUBKEY_W4_CUSTPUBKEY_W4_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W4_CUSTPUBKEY_W4_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W4_CUSTPUBKEY_W4(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W5 - This is the Customer Public Key Word5.
#define AM_REG_INFO0_CUST_PUBKEY_W5_CUSTPUBKEY_W5_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W5_CUSTPUBKEY_W5_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W5_CUSTPUBKEY_W5(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W6 - This is the Customer Public Key Word6.
#define AM_REG_INFO0_CUST_PUBKEY_W6_CUSTPUBKEY_W6_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W6_CUSTPUBKEY_W6_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W6_CUSTPUBKEY_W6(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W7 - This is the Customer Public Key Word7.
#define AM_REG_INFO0_CUST_PUBKEY_W7_CUSTPUBKEY_W7_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W7_CUSTPUBKEY_W7_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W7_CUSTPUBKEY_W7(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W8 - This is the Customer Public Key Word8.
#define AM_REG_INFO0_CUST_PUBKEY_W8_CUSTPUBKEY_W8_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W8_CUSTPUBKEY_W8_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W8_CUSTPUBKEY_W8(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W9 - This is the Customer Public Key Word9.
#define AM_REG_INFO0_CUST_PUBKEY_W9_CUSTPUBKEY_W9_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W9_CUSTPUBKEY_W9_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W9_CUSTPUBKEY_W9(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W10 - This is the Customer Public Key Word10.
#define AM_REG_INFO0_CUST_PUBKEY_W10_CUSTPUBKEY_W10_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W10_CUSTPUBKEY_W10_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W10_CUSTPUBKEY_W10(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W11 - This is the Customer Public Key Word11.
#define AM_REG_INFO0_CUST_PUBKEY_W11_CUSTPUBKEY_W11_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W11_CUSTPUBKEY_W11_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W11_CUSTPUBKEY_W11(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W12 - This is the Customer Public Key Word12.
#define AM_REG_INFO0_CUST_PUBKEY_W12_CUSTPUBKEY_W12_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W12_CUSTPUBKEY_W12_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W12_CUSTPUBKEY_W12(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W13 - This is the Customer Public Key Word13.
#define AM_REG_INFO0_CUST_PUBKEY_W13_CUSTPUBKEY_W13_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W13_CUSTPUBKEY_W13_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W13_CUSTPUBKEY_W13(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W14 - This is the Customer Public Key Word14.
#define AM_REG_INFO0_CUST_PUBKEY_W14_CUSTPUBKEY_W14_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W14_CUSTPUBKEY_W14_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W14_CUSTPUBKEY_W14(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W15 - This is the Customer Public Key Word15.
#define AM_REG_INFO0_CUST_PUBKEY_W15_CUSTPUBKEY_W15_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W15_CUSTPUBKEY_W15_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W15_CUSTPUBKEY_W15(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W16 - This is the Customer Public Key Word16.
#define AM_REG_INFO0_CUST_PUBKEY_W16_CUSTPUBKEY_W16_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W16_CUSTPUBKEY_W16_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W16_CUSTPUBKEY_W16(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W17 - This is the Customer Public Key Word17.
#define AM_REG_INFO0_CUST_PUBKEY_W17_CUSTPUBKEY_W17_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W17_CUSTPUBKEY_W17_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W17_CUSTPUBKEY_W17(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W18 - This is the Customer Public Key Word18.
#define AM_REG_INFO0_CUST_PUBKEY_W18_CUSTPUBKEY_W18_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W18_CUSTPUBKEY_W18_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W18_CUSTPUBKEY_W18(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W19 - This is the Customer Public Key Word19.
#define AM_REG_INFO0_CUST_PUBKEY_W19_CUSTPUBKEY_W19_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W19_CUSTPUBKEY_W19_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W19_CUSTPUBKEY_W19(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W20 - This is the Customer Public Key Word20.
#define AM_REG_INFO0_CUST_PUBKEY_W20_CUSTPUBKEY_W20_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W20_CUSTPUBKEY_W20_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W20_CUSTPUBKEY_W20(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W21 - This is the Customer Public Key Word21.
#define AM_REG_INFO0_CUST_PUBKEY_W21_CUSTPUBKEY_W21_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W21_CUSTPUBKEY_W21_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W21_CUSTPUBKEY_W21(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W22 - This is the Customer Public Key Word22.
#define AM_REG_INFO0_CUST_PUBKEY_W22_CUSTPUBKEY_W22_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W22_CUSTPUBKEY_W22_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W22_CUSTPUBKEY_W22(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W23 - This is the Customer Public Key Word23.
#define AM_REG_INFO0_CUST_PUBKEY_W23_CUSTPUBKEY_W23_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W23_CUSTPUBKEY_W23_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W23_CUSTPUBKEY_W23(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W24 - This is the Customer Public Key Word24.
#define AM_REG_INFO0_CUST_PUBKEY_W24_CUSTPUBKEY_W24_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W24_CUSTPUBKEY_W24_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W24_CUSTPUBKEY_W24(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

